In [29]:
import numpy as np
import pandas as pd 
import matplotlib.pyplot as plt 
%matplotlib inline

In [30]:
dataset = pd.read_csv("projectDataset/Titanic.csv")

In [31]:
dataset

                           Unnamed: 0 survived     sex      age passengerClass
0       Allen, Miss. Elisabeth Walton      yes  female  29.0000            1st
1      Allison, Master. Hudson Trevor      yes    male   0.9167            1st
2        Allison, Miss. Helen Loraine       no  female   2.0000            1st
3     Allison, Mr. Hudson Joshua Crei       no    male  30.0000            1st
4     Allison, Mrs. Hudson J C (Bessi       no  female  25.0000            1st
...                               ...      ...     ...      ...            ...
1304             Zabour, Miss. Hileni       no  female  14.5000            3rd
1305            Zabour, Miss. Thamine       no  female      NaN            3rd
1306        Zakarian, Mr. Mapriededer       no    male  26.5000            3rd
1307              Zakarian, Mr. Ortin       no    male  27.0000            3rd
1308               Zimmerman, Mr. Leo       no    male  29.0000            3rd

[1309 rows x 5 columns]

In [32]:
dataset.columns = ["Name", "Survived", "Gender", "Age", "Class"]

In [33]:
dataset

                                 Name Survived  Gender      Age Class
0       Allen, Miss. Elisabeth Walton      yes  female  29.0000   1st
1      Allison, Master. Hudson Trevor      yes    male   0.9167   1st
2        Allison, Miss. Helen Loraine       no  female   2.0000   1st
3     Allison, Mr. Hudson Joshua Crei       no    male  30.0000   1st
4     Allison, Mrs. Hudson J C (Bessi       no  female  25.0000   1st
...                               ...      ...     ...      ...   ...
1304             Zabour, Miss. Hileni       no  female  14.5000   3rd
1305            Zabour, Miss. Thamine       no  female      NaN   3rd
1306        Zakarian, Mr. Mapriededer       no    male  26.5000   3rd
1307              Zakarian, Mr. Ortin       no    male  27.0000   3rd
1308               Zimmerman, Mr. Leo       no    male  29.0000   3rd

[1309 rows x 5 columns]

In [34]:
len(dataset)

1309

In [35]:
dataset.count()

Name        1309
Survived    1309
Gender      1309
Age         1046
Class       1309
dtype: int64

In [36]:
dataset.head(15)

                               Name Survived  Gender      Age Class
0     Allen, Miss. Elisabeth Walton      yes  female  29.0000   1st
1    Allison, Master. Hudson Trevor      yes    male   0.9167   1st
2      Allison, Miss. Helen Loraine       no  female   2.0000   1st
3   Allison, Mr. Hudson Joshua Crei       no    male  30.0000   1st
4   Allison, Mrs. Hudson J C (Bessi       no  female  25.0000   1st
5               Anderson, Mr. Harry      yes    male  48.0000   1st
6   Andrews, Miss. Kornelia Theodos      yes  female  63.0000   1st
7            Andrews, Mr. Thomas Jr       no    male  39.0000   1st
8   Appleton, Mrs. Edward Dale (Cha      yes  female  53.0000   1st
9           Artagaveytia, Mr. Ramon       no    male  71.0000   1st
10           Astor, Col. John Jacob       no    male  47.0000   1st
11  Astor, Mrs. John Jacob (Madelei      yes  female  18.0000   1st
12    Aubart, Mme. Leontine Pauline      yes  female  24.0000   1st
13       Barber, Miss. Ellen Nellie      yes  female  26.0000   1st
14  Barkworth, Mr. Algernon Henry W      yes    male  80.0000   1st

In [37]:
dataset.tail(20)

                                 Name Survived  Gender   Age Class
1289          Wiklund, Mr. Karl Johan       no    male  21.0   3rd
1290  Wilkes, Mrs. James (Ellen Needs      yes  female  47.0   3rd
1291    Willer, Mr. Aaron (Abi Weller       no    male   NaN   3rd
1292               Willey, Mr. Edward       no    male   NaN   3rd
1293   Williams, Mr. Howard Hugh Harr       no    male   NaN   3rd
1294             Williams, Mr. Leslie       no    male  28.5   3rd
1295              Windelov, Mr. Einar       no    male  21.0   3rd
1296                 Wirz, Mr. Albert       no    male  27.0   3rd
1297           Wiseman, Mr. Phillippe       no    male   NaN   3rd
1298        Wittevrongel, Mr. Camille       no    male  36.0   3rd
1299              Yasbeck, Mr. Antoni       no    male  27.0   3rd
1300  Yasbeck, Mrs. Antoni (Selini Al      yes  female  15.0   3rd
1301             Youseff, Mr. Gerious       no    male  45.5   3rd
1302                Yousif, Mr. Wazli       no    male   NaN   3rd
1303            Yousseff, Mr. Gerious       no    male   NaN   3rd
1304             Zabour, Miss. Hileni       no  female  14.5   3rd
1305            Zabour, Miss. Thamine       no  female   NaN   3rd
1306        Zakarian, Mr. Mapriededer       no    male  26.5   3rd
1307              Zakarian, Mr. Ortin       no    male  27.0   3rd
1308               Zimmerman, Mr. Leo       no    male  29.0   3rd

In [38]:
dataset["Age"].mean()

np.float64(29.881134512434034)

In [39]:
dataset.Age.max()

np.float64(80.0)

In [40]:
dataset[dataset['Age'].max() == dataset['Age']]

                               Name Survived Gender   Age Class
14  Barkworth, Mr. Algernon Henry W      yes   male  80.0   1st

In [41]:
dataset_Class = dataset.groupby('Class')

In [42]:
dataset_Class.groups

{'1st': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, ...], '2nd': [323, 324, 325, 326, 327, 328, 329, 330, 331, 332, 333, 334, 335, 336, 337, 338, 339, 340, 341, 342, 343, 344, 345, 346, 347, 348, 349, 350, 351, 352, 353, 354, 355, 356, 357, 358, 359, 360, 361, 362, 363, 364, 365, 366, 367, 368, 369, 370, 371, 372, 373, 374, 375, 376, 377, 378, 379, 380, 381, 382, 383, 384, 385, 386, 387, 388, 389, 390, 391, 392, 393, 394, 395, 396, 397, 398, 399, 400, 401, 402, 403, 404, 405, 406, 407, 408, 409, 410, 411, 412, 413, 414, 415, 416, 417, 418, 419, 420, 421, 422, ...], '3rd': [600, 601, 602, 603, 604, 605, 606, 607, 608, 609, 610, 611, 612, 613, 614, 615, 616, 617, 618, 619, 620, 621, 622, 623, 624, 625, 626, 627, 628, 629, 630, 631, 632, 633, 634, 635, 636, 637, 638, 639, 640, 641, 642, 643, 644, 645, 646, 647, 648, 649, 650, 651, 652, 653, 654, 655, 656, 657, 658, 659, 660, 661, 662, 663, 664, 665, 666, 667, 668, 669, 670, 671, 672, 673, 674, 675, 676, 677, 678, 679, 680, 681, 682, 683, 684, 685, 686, 687, 688, 689, 690, 691, 692, 693, 694, 695, 696, 697, 698, 699, ...]}

In [43]:
dataset_survived = dataset.groupby("Survived")

In [44]:
dataset_survived

In [45]:
dataset_survived.groups

{'no': [2, 3, 4, 7, 9, 10, 15, 16, 19, 25, 30, 34, 38, 39, 40, 45, 46, 51, 52, 53, 58, 60, 62, 70, 71, 74, 75, 77, 80, 81, 84, 89, 96, 101, 105, 106, 110, 114, 115, 118, 125, 126, 128, 132, 135, 138, 142, 147, 148, 150, 154, 156, 157, 158, 162, 166, 169, 171, 172, 173, 174, 175, 179, 184, 185, 189, 191, 194, 197, 200, 201, 203, 205, 206, 210, 211, 212, 215, 217, 221, 222, 223, 224, 225, 226, 228, 232, 234, 236, 237, 239, 241, 243, 244, 246, 248, 252, 262, 266, 267, ...], 'yes': [0, 1, 5, 6, 8, 11, 12, 13, 14, 17, 18, 20, 21, 22, 23, 24, 26, 27, 28, 29, 31, 32, 33, 35, 36, 37, 41, 42, 43, 44, 47, 48, 49, 50, 54, 55, 56, 57, 59, 61, 63, 64, 65, 66, 67, 68, 69, 72, 73, 76, 78, 79, 82, 83, 85, 86, 87, 88, 90, 91, 92, 93, 94, 95, 97, 98, 99, 100, 102, 103, 104, 107, 108, 109, 111, 112, 113, 116, 117, 119, 120, 121, 122, 123, 124, 127, 129, 130, 131, 133, 134, 136, 137, 139, 140, 141, 143, 144, 145, 146, ...]}

In [47]:
len(dataset_survived.get_group("yes"))

500

In [48]:
survivor = dataset_survived.get_group('yes')

In [49]:
survivor[survivor['Age'].min() == survivor['Age']]

                               Name Survived  Gender     Age Class
763  Dean, Miss. Elizabeth Gladys M      yes  female  0.1667   3rd

In [52]:
dataset_Class['Age'].get_group("2nd").mean()

np.float64(29.506704980842912)